of/org/Myanmar/transient/8000/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

// internalField   uniform 0.00375;
internalField   uniform 0.093750;

boundaryField
{
    inlet
    {
//        type            freestreamPressure;
        type            fixedValue;
        value           uniform 0.093750;
    }

    outlet
    {
//        type            freestreamPressure;
        type            zeroGradient;
    }

    top
    {
        type            symmetryPlane;
    }

    bottom
    {
        type            symmetryPlane;
    }

    deck
    {
        type            kqRWallFunction;
        value           uniform 0.093750;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
